ltml.tests/manifest01_ver_1.0_case4.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.8" jmeter="2.13 r1665067">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="manifest01" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="userdefine" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
    <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="LG01" enabled="true">
      <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="loopcontroller" enabled="true">
        <boolProp name="LoopController.continue_forever">false</boolProp>
      </elementProp>
      <stringProp name="ThreadGroup.num_threads">20</stringProp>
      <stringProp name="ThreadGroup.ramp_time">60</stringProp>
      <boolProp name="ThreadGroup.scheduler">true</boolProp>
      <longProp name="ThreadGroup.start_time">1439315566307</longProp>
      <longProp name="ThreadGroup.end_time">1439315566307</longProp>
      <stringProp name="ThreadGroup.duration">0</stringProp>
      <stringProp name="ThreadGroup.delay">0</stringProp>
    </ThreadGroup>
    <hashTree>
    <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="BP01_01" enabled="true">
      <boolProp name="TransactionController.includeTimers">false</boolProp>
      <boolProp name="TransactionController.parent">false</boolProp>
    </TransactionController>
    <hashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="BP01_01" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="userdefinedvariable" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">localhost</stringProp>
        <stringProp name="HTTPSampler.port">80</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.path">localhosttest1</stringProp>
        <stringProp name="HTTPSampler.method">GET</stringProp>
        <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        <boolProp name="HTTPSampler.monitor">false</boolProp>
      </HTTPSamplerProxy>
      <hashTree/>
    </hashTree>
    <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="BP01_02" enabled="true">
      <boolProp name="TransactionController.includeTimers">false</boolProp>
      <boolProp name="TransactionController.parent">false</boolProp>
    </TransactionController>
    <hashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="BP01_02" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="userdefinedvariable" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">localhost</stringProp>
        <stringProp name="HTTPSampler.port">80</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.path">localhosttest2</stringProp>
        <stringProp name="HTTPSampler.method">GET</stringProp>
        <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        <boolProp name="HTTPSampler.monitor">false</boolProp>
      </HTTPSamplerProxy>
      <hashTree/>
    </hashTree>
    </hashTree>
    <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="SummaryReport" enabled="true">
      <boolProp name="ResultCollector.error_logging">false</boolProp>
    </ResultCollector>
    <hashTree/>
    <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.HitsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Hits per Second" enabled="true">
      <boolProp name="ResultCollector.error_logging">false</boolProp>
      <longProp name="interval_grouping">1000</longProp>
      <boolProp name="graph_aggregated">false</boolProp>
      <boolProp name="include_checkbox_state">false</boolProp>
      <boolProp name="exclude_checkbox_state">false</boolProp>
    </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
    <hashTree/>
    <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second" enabled="true">
      <boolProp name="ResultCollector.error_logging">false</boolProp>
      <longProp name="interval_grouping">1000</longProp>
      <boolProp name="graph_aggregated">false</boolProp>
      <boolProp name="include_checkbox_state">false</boolProp>
      <boolProp name="exclude_checkbox_state">false</boolProp>
    </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
    <hashTree/>
    <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time" enabled="true">
      <boolProp name="ResultCollector.error_logging">false</boolProp>
      <longProp name="interval_grouping">500</longProp>
      <boolProp name="graph_aggregated">false</boolProp>
      <boolProp name="include_checkbox_state">false</boolProp>
      <boolProp name="exclude_checkbox_state">false</boolProp>
    </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
    <hashTree/>
    <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ThreadsStateOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Active Threads Over Time" enabled="true">
      <boolProp name="ResultCollector.error_logging">false</boolProp>
      <longProp name="interval_grouping">500</longProp>
      <boolProp name="graph_aggregated">false</boolProp>
      <boolProp name="include_checkbox_state">false</boolProp>
      <boolProp name="exclude_checkbox_state">false</boolProp>
    </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
    <hashTree/>
    <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="SimpleDataWriter" enabled="true">
      <boolProp name="ResultCollector.error_logging">false</boolProp>
    </ResultCollector>
    </hashTree>
  </hashTree>
</jmeterTestPlan>